app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("body", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["created_at", "2015-12-07 12:06:41.198360"], ["name", ""], ["post_id", 3], ["updated_at", "2015-12-07 12:06:41.198360"]]