app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "something"], ["created_at", "2015-11-25 17:57:55.307058"], ["title", "look at this"], ["updated_at", "2015-11-25 17:57:55.307058"]]

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 19  [["body", "Edited existing post"], ["updated_at", "2016-07-11 13:02:26.293319"]]